{"created_time": "2017-11-19T03:02:38+0000", "message": "Great job by all law enforcement involved. These operations shed light on the demand fueling commercial sexual  exploitation. No Demand No Supply. \n#LEO #EndHumanTrafficking", "message_tags": [{"id": "479647825436380", "name": "#Leo", "offset": 148, "length": 4}, {"id": "593609360666840", "name": "#endhumantrafficking", "offset": 153, "length": 20}], "permalink_url": "https://www.facebook.com/1003344626383879/posts/1667126073339061/", "attachments": {"data": [{"description": "Media Release: Sheriff and Law Enforcement Partners Combat Human Trafficking\n\nNovember 17, 2017 – During the past three months, the Washington County Sheriff’s Office and law enforcement partners have arrested 22 men during two missions intended to proactively combat human trafficking in Washington County, Oregon.\n\nThe Washington County Sheriff’s Office, in partnership with the Portland Police Bureau’s Sex Trafficking Unit, Forest Grove Police and the Washington County District Attorney’s Office, announces the arrest of 22 men during two separate missions the past three months.\n\nThe stated goal of these missions is to break a link in the chain of human trafficking by enforcing state and federal laws and developing intelligence on those trafficking victims in Washington County.\n\nSheriff Pat Garrett reminds us that “human trafficking is a terrible reality in our community. Joined by our wonderful public safety partners, we are committed to continue interdiction efforts to rescue victims and hold accountable all those who perpetuate these crimes.”\n\nThose arrested during missions in September and November include:\n\n- Majid L. Abdulla, 36, of Beaverton, for Commercial Sexual Solicitation;\n- Nicholas R. Arntsen, 21, of Portland, for Commercial Sexual Solicitation;\n- Roy P. Carino, 51, of Beaverton, for Commercial Sexual Solicitation;\n- Javies Chavez, 24, of Cornelius, for Commercial Sexual Solicitation;\n- Jesus Cruz-Arreguin, 33, of Gervais, for Commercial Sexual Solicitation and Theft III;\n- Richard Derby, 19, of Forest Grove, for Commercial Sexual Solicitation;\n- Lazaro Echevarria-Martinez, 46, of Forest Grove, for Commercial Sexual Solicitation;\n- Pedro Escalona-Varela, 31, of Beaverton, for Commercial Sexual Solicitation;\n- Rigoberto Figueroa-Gutierrez, 35, for Commercial Sexual Solicitation;\n- Charles F. Giaquinto, 48, of Beaverton, for Commercial Sexual Solicitation;\n- Shubham Gilda, 32, of Hillsboro for Commercial Sexual Solicitation;\n- Abhishek Kumar, 31, of Hillsboro, for Commercial Sexual Solicitation;\n- Galo M. Legarda, 39, of Gladstone, for Commercial Sexual Solicitation;\n- Joseph T. Martinez, 24, of Aurora, for Commercial Sexual Solicitation;\n- John W. Miller, 44, of Seabec, Washington, for Commercial Sexual Solicitation;\n- Domenico A. Opiela, 46, of Deerfield Beach, Florida, for Commercial Sexual Solicitation;\n- John M. Pearson, 73, of Cornelius, for Commercial Sexual Solicitation;\n- Daniel N. Radtke, 39, of Beaverton, for Commercial Sexual Solicitation;\n- Isagani C. Rausa, 33, of Tigard, for Commercial Sexual Solicitation;\n- Rene Rodriguez-Abarca, 37, of Forest Grove, for Commercial Sexual Solicitation;\n- Gaspar Silva-Zavala, 43, of Beaverton, for Commercial Sexual Solicitation;\n- Apurva H. Thakkar, 27, of Salem, for Commercial Sexual Solicitation.\n\nThe Washington County Sheriff’s Office wishes to thank local hotels who have provided resources and assistance for these missions.\n\nFor the integrity of future missions, we specifically request that the media not report the locations of these missions.\n\nRead the full media release here: bit.ly/2AP2SGL", "description_tags": [{"id": "182110415276207", "length": 25, "name": "Washington County, Oregon", "offset": 289, "type": "page"}, {"id": "65391820903", "length": 22, "name": "Portland Police Bureau", "offset": 381, "type": "page"}, {"id": "100291346690128", "length": 19, "name": "Forest Grove Police", "offset": 428, "type": "page"}], "media": {"image": {"height": 405, "src": "https://scontent-lax3-1.xx.fbcdn.net/v/t31.0-8/s720x720/23593455_10155313518441936_8313298389396722025_o.jpg?_nc_cat=104&ccb=1-3&_nc_sid=8024bb&_nc_ohc=AfU2df9GhPgAX_tEMab&_nc_ht=scontent-lax3-1.xx&tp=7&oh=a89cb8f9fc64bdfe87ad0b05aa14251a&oe=606F12AA", "width": 720}}, "target": {"id": "10155313518441936", "url": "https://www.facebook.com/WCSOOregon/photos/a.56915846935/10155313518441936/?type=3"}, "type": "photo", "url": "https://www.facebook.com/WCSOOregon/photos/a.56915846935/10155313518441936/?type=3"}]}, "id": "1003344626383879_1667126073339061"}