{"created_time": "2018-01-28T02:56:31+0000", "message": "#MakingADifference ❤️", "message_tags": [{"id": "136254236549866", "name": "#makingadifference", "offset": 0, "length": 18}], "permalink_url": "https://www.facebook.com/1003344626383879/posts/1740432862675048/", "attachments": {"data": [{"description": "In late November, police officers with the Costa Mesa Police Department responded to a domestic violence disturbance call at a motel and upon further investigation, located a 16-year-old victim in the room. When the victim met the officers and detective on the case, she was impressed by how they treated her. At one point, she wanted to run and the detective reached out to her to encourage her to stay. He told her he would go see her the next day and since then, maintained contact with her. Going to court to face her perpetrator was trying and stressful on her as the defendant stared at her, mouthed at her, and tried to make contact, but she still pushed through. Even under those difficult times, the victim wanted to do something nice, so she asked her Advocate if she could bake brownies for the three officers and detective. One of our volunteers offered her kitchen at home and they baked blackberry cheesecake brownies. The following morning, the Advocate brought the young survivor to the police department to deliver the brownies and in return, they surprised her with Christmas presents. They told her how proud of her they were and asked her how she was doing and what was happening with her placement. They also asked if they could stay in touch with her and check in on her. The Christmas gifts they gave her were books, which they remembered when she mentioned to them that she likes to read. This young girl who had no home and no one who cared what happened to her still found a way to do something nice back in return. These police officers were likely the first people who she felt genuinely cared for her well-being in a very long time.\n\nDay 27: BE THE ONE to make an impact today by asking yourself, \"What role can I play in keeping the continuity of the victim-centered approach?\" Everyone can make a difference.", "media": {"image": {"height": 296, "src": "https://scontent-lax3-2.xx.fbcdn.net/v/t1.0-9/26993199_1201682826642053_3320512898304548616_n.jpg?_nc_cat=111&ccb=1-3&_nc_sid=8024bb&_nc_ohc=DTuRcxlTmdcAX-knLss&_nc_ht=scontent-lax3-2.xx&oh=2b94ebbb16dddf8d98831fd1d811c11c&oe=606F8CAD", "width": 262}}, "target": {"id": "1201682826642053", "url": "https://www.facebook.com/ochttf/photos/a.349099951900349/1201682826642053/?type=3"}, "type": "photo", "url": "https://www.facebook.com/ochttf/photos/a.349099951900349/1201682826642053/?type=3"}]}, "id": "1003344626383879_1740432862675048"}