{"created_time": "2019-12-17T01:18:20+0000", "message": "Valuable insight from Shanika Ampah on the importance of community involvement and the need for human trafficking awareness. Children shouldn’t be given the burden of having to make an outcry for help before someone steps in with assistance. Their safety is OUR responsibility as a community. Please follow Guiding Light Outreach for more great information.", "permalink_url": "https://www.facebook.com/1003344626383879/posts/2805603156158008/", "attachments": {"data": [{"description": "Looking back, as a child victim of human trafficking I was not a high school dropout, I was disenrolled because of my poor attendance. No one asked why. My sixteenth birthday was on a  Monday, they disenrolled me on a Friday. I walked away feeling broken. No where to go. More days alone to be sexual abused for food and shelter.  \nHow could a child in all honour classes fall through the cracks?  How could this happen to any child from a community, any child in a school system, ANY CHILD!\n\nDisenrolled: to remove from a roll broadly: to release from membership in an organization.\n\n* I lost my membership to Miami-Dade County Public System. (It's still happening to children today.)\n\nDropout: a person who had abandoned a course of study or who has rejected conventional society to pursue an alternative lifestyle. \n\n(I didn't choose what happened to me.)\n\nIf I say I was a high school dropout that places the responsibility on me.\n\nGuiding Light Outreach Inc. purpose is to shine light on community issues.  We can see \"red flags\" before or while a child is being victimized and  before they become a \"criminal.\" Poor school attendance, declining school performance, isolation, change in pattern, change in interest. \n\nAwareness Tips: School attendance and grades can tell alot about a child's home/living situation. Teachers can better teach a mentally and physically healthy child. \n\nSchool faculty and staff you are on the frontlines. \n\nDrugs, gang activity, sexual abuse, verbal abuse, homelessness, depression, learning disabilities, etc. are all issues that a school system can help identify then we must have the resources. We are here to help. \n\nInbox or call us if you are not clear on how you can help a child.", "media": {"image": {"height": 466, "src": "https://scontent-lax3-2.xx.fbcdn.net/v/t1.0-9/80025285_2427883610650400_7353688076150898688_n.jpg?_nc_cat=111&ccb=1-3&_nc_sid=110474&_nc_ohc=XxA5p0TShPQAX_2owV0&_nc_ht=scontent-lax3-2.xx&oh=a292d8170713b1c480b252297e7fd2d5&oe=606EC589", "width": 466}}, "target": {"id": "2427883607317067", "url": "https://www.facebook.com/gloinc.2012/photos/a.1396083463830425/2427883607317067/?type=3"}, "type": "photo", "url": "https://www.facebook.com/gloinc.2012/photos/a.1396083463830425/2427883607317067/?type=3"}]}, "id": "1003344626383879_2805603156158008"}