{"created_time": "2019-03-21T20:16:10+0000", "message": "‪Another bad guy locked up! The San Bernardino County Sheriff's Department Human Trafficking Task Force is making a difference in their community.  #le #makingadifference ‬", "message_tags": [{"id": "503112256421253", "name": "San Bernardino County Sheriff's Department", "type": "page", "offset": 32, "length": 42}, {"id": "171980396286315", "name": "#le", "offset": 148, "length": 3}, {"id": "136254236549866", "name": "#makingadifference", "offset": 152, "length": 18}], "permalink_url": "https://www.facebook.com/1003344626383879/posts/2292074880844174/", "attachments": {"data": [{"description": "Charles Sanford is arrested for pimping, pandering, and human trafficking in various counties including Clark County — LVMPD Ontario Police Department \n\nDATE/TIME:   March 14, 2019/4:00pm\n \nINCIDENT:      Pimping, Pandering and Human Trafficking of an Adult\n \nLOCATION:    900 Block of W. Granada Ct. Ontario\n \nSUSPECT:      Charles Sanford, 31 year old male resident of Ontario\n \nVICTIMS:        Victim #1- Confidential, 19-year-old female from Las Vegas\n                        Victim #2 - Confidential, 23-year-old female from Pasadena \n \n \nSUMMARY: On Thursday, March 14, 2019, at about 4:00 pm., San Bernardino County Human Trafficking Task Force investigators responded to a request for assistance from an officer at the Ontario Police Department. Task Force investigators had been told, a female from Las Vegas, Nevada, had contacted Ontario officers and reported being Human Trafficked by a known suspect, identified as Charles Sanford of Ontario, CA. The victim indicated she has been continuously trafficked by Sanford over the last four months within the counties of San Bernardino, Orange County, and Los Angeles County, as well as Las Vegas, Nevada. She had fled from Sanford earlier that day from a residence in the 900 Block of  W. Granada Court. The victim also said a second female, later identified as Victim #2, was currently with Sanford, and also being trafficked by him. In addition to the initial information provided by Victim #1, investigators discovered that Sanford has used force and fear upon Victim #1, to gain her cooperation while involved in prostitution on his behalf, and he was known to carry a firearam on his person.\n \nTask Force members conducted surveillance of the residence in which Sanford and Victim #2, were said to be staying. After several hours, investigators had seen a male and female, matching the descriptions of Sanford and Victim #2, exit the residence and begin walking away from the location. With the assistance of a uniformed Ontario Police officer, attempted to make contact with the suspect and Victim #2. The suspect immediately fled on foot back towards the residence. The officer pursued the male, later confirmed to be Sanford, but was unable to apprehend him before he reached the residence. Additional Ontario Police officers responded to the scene to assist and contained the area. Due to Sanford's refusal to exit the residence and surrender, the possibility he was armed with a weapon and the presence of small children inside the residence, Ontario officers deployed a tactical vehicle equipped with a loudspeaker. After approximately an hour of loudspeaker announcements being made for Sanford's surrender, he exited the residence and was taken into custody without incident, by Ontario Police officers. Task Force members then served a search warrant at the residence, locating evidence supporting Human Trafficking allegations. As a result of continued investigation, a second residence used by Sanford was located in the City of Victorville. Task Force members authored and served a search warrant at the residence, locating additional evidence supporting Human Trafficking allegations.\n \nSanford and Victim #2, were transported to the Ontario Police Department for processing and interviews. During that time, investigators found that Sanford had multiple active and outstanding warrants for his arrest issued out of San Bernardino and Los Angeles Counties, one for being a felon in possession of a firearm.  He was booked into West Valley Detention Center for felony violations of Pimping, Pandering and Human Trafficking of an Adult.\n \nThe San Bernardino County Human Trafficking Task Force is made up of investigators from the San Bernardino County Sheriff's Department, San Bernardino County District Attorney's Office, San Bernardino Police Department, Ontario Police Department, Redlands Police Department, California State Parole, Office of Homeland Security and the Federal Bureau of Investigation.\n \nThis investigation is ongoing. Investigators believe there are other unidentified victims related to this case and are asking that anyone with information related to this investigation, please contact the San Bernardino County Human Trafficking Task Force at (909)387-8400. Anyone wishing to remain anonymous may contact We-Tip at 1-888-78-CRIME or you may leave information on the WE-Tip Hotline at www.wetip.com.\n \n \n \n \nRefer:              Off. J. Neal and Det. K. Hernandez\n \nStation:            San Bernardino County Human Trafficking Task Force\n \nPhone No.       (909) 387-8400\n \nCase No.         621900096\n \nJOHN McMAHON, Sheriff-Coroner\nSan Bernardino County Sheriff-Coroner Department", "description_tags": [{"id": "34067265638", "length": 5, "name": "LVMPD", "offset": 119, "type": "page"}, {"id": "152512618126438", "length": 25, "name": "Ontario Police Department", "offset": 125, "type": "page"}], "media": {"image": {"height": 614, "src": "https://scontent-lax3-1.xx.fbcdn.net/v/t1.0-9/54524029_2159489254116870_3210601621285240832_n.jpg?_nc_cat=100&ccb=1-3&_nc_sid=8024bb&_nc_ohc=bOjSfgtkipUAX_v83mX&_nc_ht=scontent-lax3-1.xx&oh=291e58ad0acacaa7eb9e8fa85997c193&oe=606E83E2", "width": 477}}, "target": {"id": "2159489250783537", "url": "https://www.facebook.com/sbcountysheriff/photos/a.683139731751837/2159489250783537/?type=3"}, "type": "photo", "url": "https://www.facebook.com/sbcountysheriff/photos/a.683139731751837/2159489250783537/?type=3"}]}, "id": "1003344626383879_2292074880844174"}